papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/beamInCrossFlow.Gillebaart2015/base/partitioned/system/solid/blockMeshDict.3
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    // Level 0
    (0.45 0 0)
    (0.55 0 0)
    (0.55 0 -0.2)
    (0.45 0 -0.2)

    // Level 1
    (0.45 0.2 0)
    (0.55 0.2 0)
    (0.55 0.2 -0.2)
    (0.45 0.2 -0.2)
);

blocks
(
    hex (3 2 6 7 0 1 5 4) (8 16 16) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall interface
    (
        (3 0 4 7)
        (2 3 7 6)
        (1 2 6 5)
        (4 5 6 7)
    )
    symmetry symmetry
    (
        (0 1 5 4)
    )
    wall bottom
    (
        (0 3 2 1)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
